import { logEnvConfigStatus } from "@/lib/env-logger";

const BANNER = `
 ██████╗ ██████╗ ███████╗███╗   ██╗
██╔═══██╗██╔══██╗██╔════╝████╗  ██║
██║   ██║██████╔╝█████╗  ██╔██╗ ██║
██║   ██║██╔═══╝ ██╔══╝  ██║╚██╗██║
╚██████╔╝██║     ███████╗██║ ╚████║
 ╚═════╝ ╚═╝     ╚══════╝╚═╝  ╚═══╝

 ██████╗ ██████╗ ███╗   ███╗███╗   ███╗ █████╗ ███╗   ██╗██████╗ ███████╗██████╗
██╔════╝██╔═══██╗████╗ ████║████╗ ████║██╔══██╗████╗  ██║██╔══██╗██╔════╝██╔══██╗
██║     ██║   ██║██╔████╔██║██╔████╔██║███████║██╔██╗ ██║██║  ██║█████╗  ██████╔╝
██║     ██║   ██║██║╚██╔╝██║██║╚██╔╝██║██╔══██║██║╚██╗██║██║  ██║██╔══╝  ██╔══██╗
╚██████╗╚██████╔╝██║ ╚═╝ ██║██║ ╚═╝ ██║██║  ██║██║ ╚████║██████╔╝███████╗██║  ██║
 ╚═════╝ ╚═════╝ ╚═╝     ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═════╝ ╚══════╝╚═╝  ╚═╝
`;

/**
 * This won't work unless you host this as an actual server,
 * which is highly recommended.
 */
export async function register() {
  console.log(BANNER);
  const serverTimezone = Intl.DateTimeFormat().resolvedOptions().timeZone;
  console.log("🗓️  Date:", new Date());
  console.log("🕛 Server Timezone:", serverTimezone);

  if (process.env.NEXT_RUNTIME === "nodejs") {
    logEnvConfigStatus();
    const { start } = await import("@/server/proxy");
    start().catch((err) => console.error("[proxy] failed to start:", err));
    console.log("🟢 Proxy started");
  }
}
